# RebarSystemHookOrientBackDirn1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemHookOrientBackDirn1 Property
ParameterTypeId Class See Also
---
"Interior Major Hook Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemHookOrientBackDirn1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemHookOrientBackDirn1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemHookOrientBackDirn1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace